In [1]:
# -*- coding: utf-8 -*-
"""
Created on 2021

@author: Administrator
"""

'\nCreated on 2021\n\n@author: Administrator\n'

In [2]:

# =============================================================================
# =============================================================================
# # 문제 11 유형(DataSet_11.csv 이용)

# 구분자 : comma(“,”), 470 Rows, 4 Columns, UTF-8 인코딩

# 세계 각국의 행복지수를 비롯한 여러 정보를 조사한 DS리서치는
# 취합된 자료의 현황 파악 및 간단한 통계분석을 실시하고자 한다.

# 컬 럼 / 정 의 / Type
# Country / 국가명 / String
# Happiness_Rank / 당해 행복점수 순위 / Double
# Happiness_Score / 행복점수 / Double
# year / 년도 / Double
# =============================================================================
# =============================================================================

In [3]:
import pandas as pd
import numpy as np

data11 = pd.read_csv('Dataset/Dataset_11.csv')
print(data11.info())
print(data11.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 470 entries, 0 to 469
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          470 non-null    object
 1   Happiness_Rank   470 non-null    int64
 2   Happiness_Score  470 non-null    float64
 3   year             470 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 14.8+ KB
None
       Country  Happiness_Rank  Happiness_Score  year
0  Switzerland               1            7.587  2015
1      Iceland               2            7.561  2015
2      Denmark               3            7.527  2015
3       Norway               4            7.522  2015
4       Canada               5            7.427  2015

In [7]:

# =============================================================================
# 1.분석을 위해 3년 연속 행복지수가 기록된 국가의 데이터를 사용하고자 한다.
# 3년 연속 데이터가 기록되지 않은 국가의 개수는?
# - 국가명 표기가 한 글자라도 다른 경우 다른 국가로 처리하시오.
# - 3년 연속 데이터가 기록되지 않은 국가 데이터는 제외하고 이를 향후 분석에서
# 활용하시오.(답안 예시) 1
# =============================================================================

In [39]:
data11[data11.Country == 'Afghanistan']

         Country  Happiness_Rank  Happiness_Score  year
152  Afghanistan             153            3.575  2015
311  Afghanistan             154            3.360  2016
455  Afghanistan             141            3.794  2017

In [40]:
q1 = pd.pivot_table(data11, index='Country', columns='year', values='Happiness_Score')
q1

year          2015   2016   2017
Country
Afghanistan  3.575  3.360  3.794
Albania      4.959  4.655  4.644
Algeria      5.605  6.355  5.872
Angola       4.033  3.866  3.795
Argentina    6.574  6.650  6.599
...            ...    ...    ...
Venezuela    6.810  6.084  5.250
Vietnam      5.360  5.061  5.074
Yemen        4.077  3.724  3.593
Zambia       5.129  4.795  4.514
Zimbabwe     4.610  4.193  3.875

[166 rows x 3 columns]

In [41]:
(data11.groupby('Country').apply(len) < 3).sum()

20

In [42]:
# 답 : 20

In [43]:
q1.isna().any(axis=1).sum()

20

In [44]:
q1.isnull().sum()

year
2015     8
2016     9
2017    11
dtype: int64

In [23]:

# =============================================================================
# 2.(1번 산출물을 활용하여) 2017년 행복지수와 2015년 행복지수를 활용하여 국가별
# 행복지수 증감률을 산출하고 행복지수 증감률이 가장 높은 3개 국가를 행복지수가
# 높은 순서대로 차례대로 기술하시오.
# 증감률 = (2017년행복지수−2015년행복지수)/2
#
# - 연도는 년월(YEAR_MONTH) 변수로부터 추출하며, 연도별 매출금액합계는 1월부터
# 12월까지의 매출 총액을 의미한다. (답안 예시) Korea, Japan, China
# =============================================================================

In [45]:
q2 = q1.dropna()
q2

year          2015   2016   2017
Country
Afghanistan  3.575  3.360  3.794
Albania      4.959  4.655  4.644
Algeria      5.605  6.355  5.872
Angola       4.033  3.866  3.795
Argentina    6.574  6.650  6.599
...            ...    ...    ...
Venezuela    6.810  6.084  5.250
Vietnam      5.360  5.061  5.074
Yemen        4.077  3.724  3.593
Zambia       5.129  4.795  4.514
Zimbabwe     4.610  4.193  3.875

[146 rows x 3 columns]

In [48]:
q3 = q2.copy()
q3['ratio'] = (q2[2017] - q2[2015]) / 2
q3

year          2015   2016   2017   ratio
Country
Afghanistan  3.575  3.360  3.794  0.1095
Albania      4.959  4.655  4.644 -0.1575
Algeria      5.605  6.355  5.872  0.1335
Angola       4.033  3.866  3.795 -0.1190
Argentina    6.574  6.650  6.599  0.0125
...            ...    ...    ...     ...
Venezuela    6.810  6.084  5.250 -0.7800
Vietnam      5.360  5.061  5.074 -0.1430
Yemen        4.077  3.724  3.593 -0.2420
Zambia       5.129  4.795  4.514 -0.3075
Zimbabwe     4.610  4.193  3.875 -0.3675

[146 rows x 4 columns]

In [49]:
q3['ratio'].nlargest(3).index

Index(['Latvia', 'Romania', 'Togo'], dtype='object', name='Country')

In [50]:
# 답: Latvia, Romania, Togo

In [51]:

# =============================================================================
# 3.(1번 산출물을 활용하여) 년도별 행복지수 평균이 유의미하게 차이가 나는지
# 알아보고자 한다.
# 이와 관련하여 적절한 검정을 사용하고 검정통계량을 기술하시오.
# - 해당 검정의 검정통계량은 자유도가 2인 F 분포를 따른다.
# - 검정통계량은 소수점 넷째 자리까지 기술한다. (답안 예시) 0.1234
# =============================================================================

# (참고)
# from statsmodels.formula.api import ols
# from statsmodels.stats.anova import anova_lm

In [52]:
from scipy.stats import f_oneway

In [54]:
q3_out = f_oneway(q3[2015], q3[2016], q3[2017])
q3_out

F_onewayResult(statistic=0.004276725037689305, pvalue=0.9957324489944479)

In [55]:
q3_out.statistic

0.004276725037689305

In [56]:
# 답 : 0.0042

In [57]:
q4 = data11[data11.Country.isin(q3.index)]
q4

         Country  Happiness_Rank  Happiness_Score  year
0    Switzerland               1            7.587  2015
1        Iceland               2            7.561  2015
2        Denmark               3            7.527  2015
3         Norway               4            7.522  2015
4         Canada               5            7.427  2015
..           ...             ...              ...   ...
464         Togo             150            3.495  2017
465       Rwanda             151            3.471  2017
466        Syria             152            3.462  2017
467     Tanzania             153            3.349  2017
468      Burundi             154            2.905  2017

[438 rows x 4 columns]

In [58]:
len(data11)

470

In [59]:
len(q4)

438

In [60]:
from statsmodels.formula.api import ols

In [64]:
q4_model = ols('Happiness_Score~C(year)', data=q4).fit()

In [65]:
q4_model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:        Happiness_Score   R-squared:                       0.000
Model:                            OLS   Adj. R-squared:                 -0.005
Method:                 Least Squares   F-statistic:                  0.004277
Date:                Wed, 16 Feb 2022   Prob (F-statistic):              0.996
Time:                        16:25:34   Log-Likelihood:                -678.98
No. Observations:                 438   AIC:                             1364.
Df Residuals:                     435   BIC:                             1376.
Df Model:                           2
Covariance Type:            nonrobust
===================================================================================
                      coef    std err          t      P>|t|      [0.025      0.975]
-----------------------------------------------------------------------------------
Intercept           5.3959      0.095     56.983      0.000       5.210       5.582
C(year)[T.2016]    -0.0112      0.134     -0.084      0.933      -0.274       0.252
C(year)[T.2017]    -0.0010      0.134     -0.007      0.994      -0.264       0.262
==============================================================================
Omnibus:                       41.991   Durbin-Watson:                   0.078
Prob(Omnibus):                  0.000   Jarque-Bera (JB):               13.285
Skew:                           0.050   Prob(JB):                      0.00130
Kurtosis:                       2.153   Cond. No.                         3.73
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [66]:
from statsmodels.stats.anova import anova_lm

In [68]:
print(anova_lm(q4_model))

             df      sum_sq   mean_sq         F    PR(>F)
C(year)     2.0    0.011198  0.005599  0.004277  0.995732
Residual  435.0  569.472307  1.309132       NaN       NaN

In [70]:
anova_lm(q4_model)['F'][0]

0.004276725037677812

In [71]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [72]:
q4_out_multi = pairwise_tukeyhsd(q4['Happiness_Score'], q4['year'])
q4_out_multi

In [73]:
dir(q4_out_multi)

['__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_multicomp',
 '_results_table',
 '_simultaneous_ci',
 'confint',
 'data',
 'df_total',
 'groups',
 'groupsunique',
 'meandiffs',
 'plot_simultaneous',
 'pvalues',
 'q_crit',
 'reject',
 'reject2',
 'std_pairs',
 'summary',
 'variance']

In [74]:
print(q4_out_multi)

Multiple Comparison of Means - Tukey HSD, FWER=0.05
===================================================
group1 group2 meandiff p-adj   lower  upper  reject
---------------------------------------------------
  2015   2016  -0.0112 0.9962 -0.3261 0.3038  False
  2015   2017   -0.001    1.0 -0.3159  0.314  False
  2016   2017   0.0102 0.9968 -0.3047 0.3251  False
---------------------------------------------------

In [ ]:

# =============================================================================
# =============================================================================
# # 문제 12 유형(DataSet_12.csv 이용)

# 구분자 : comma(“,”), 5000 Rows, 7 Columns, UTF-8 인코딩

# 직장인의 독서 실태를 분석하기 위해서 수도권 거주자 5000명을
# 대상으로 간단한 인적 사항과 연간 독서량 정보를 취합하였다.

# 컬 럼 / 정 의 / Type
# Age / 나이 / String
# Gender / 성별(M: 남성) / String
# Dependent_Count / 부양가족 수 / Double
# Education_Level / 교육 수준 / String
# is_Married / 결혼 여부(1: 결혼) / Double
# Read_Book_per_Year / 연간 독서량(권) / Double
# Income_Range / 소득 수준에 따른 구간(A < B < C < D < E)이며 X는
# 정보 누락 / String
# =============================================================================
# =============================================================================

In [ ]:

# =============================================================================
# 1.수치형 변수를 대상으로 피어슨 상관분석을 실시하고 연간 독서량과 가장
# 상관관계가 강한 변수의 상관계수를 기술하시오
# - 상관계수는 반올림하여 소수점 셋째 자리까지 기술하시오. (답안 예시) 0.123
# =============================================================================

In [ ]:

# =============================================================================
# 2.석사 이상(석사 및 박사) 여부에 따라서 연간 독서량 평균이 유의미하게 다른지 가설
# 검정을 활용하여 알아보고자 한다. 독립 2표본 t검정을 실시했을 때
# 유의 확률(pvalue)의 값을 기술하시오.
# - 등분산 가정 하에서 검정을 실시한다.
# - 유의 확률은 반올림하여 소수점 셋째 자리까지 기술한다. (답안 예시) 0.123
# =============================================================================

In [ ]:

# =============================================================================
# 3.독서량과 다른 수치형 변수의 관계를 다중선형회귀분석을 활용하여 알아보고자 한다.
# 연간 독서량을 종속변수, 나머지 수치형 자료를 독립변수로 한다. 이렇게 생성한
# 선형회귀 모델을 기준으로 다른 독립변수가 고정이면서 나이만 다를 때, 40살은 30살
# 보다 독서량이 얼마나 많은가?
# - 학사 이상이면서 소득 구간 정보가 있는 데이터만 사용하여 분석을 실시하시오.
# - 결과값은 반올림하여 정수로 표기하시오. (답안 예시) 1
# =============================================================================

# (참고)
# from statsmodels.formula.api import ols

In [ ]:

# =============================================================================
# =============================================================================
# # 문제 13 유형(DataSet13_train.csv / DataSet13_test.csv  이용)

# 구분자 :
#     comma(“,”), 1500 Rows, 10 Columns, UTF-8 인코딩 /
#     comma(“,”), 500 Rows, 10 Columns, UTF-8 인코딩

# 전국의 데이터 분석가 2000명을 대상으로 이직 관련 설문조사를 실시하였다.
# 설문 대상자의 특성 및 이직 의사와 관련 인자를 면밀히 살펴보기 위해 다양한
# 분석을 실시하고자 한다.

# 컬 럼 / 정 의 / Type
# city_development_index / 거주 도시 개발 지수 / Double
# gender / 성별 / String
# relevent_experience / 관련 직무 경험 여부(1 : 유경험) / Integer
# enrolled_university / 대학 등록 형태(1 : 풀타임/파트타임) / Integer
# education_level / 교육 수준 / String
# major_discipline / 전공 / String
# experience / 경력 / Double
# last_new_job / 현 직장 직전 직무 공백 기간 / Double
# training_hours / 관련 직무 교육 이수 시간 / Double
# target / 이직 의사 여부(1 : 의사 있음) / Integer
# =============================================================================
# =============================================================================

In [ ]:

# =============================================================================
# 1.(Dataset_13_train.csv를 활용하여) 경력과 최근 이직시 공백기간의 상관관계를 보고자
# 한다. 남여별 피어슨 상관계수를 각각 산출하고 더 높은 상관계수를 기술하시오.
# - 상관계수는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# =============================================================================

In [ ]:

# =============================================================================
# 2.(Dataset_13_train.csv를 활용하여) 기존 데이터 분석 관련 직무 경험과 이직 의사가 서로
# 관련이 있는지 알아보고자 한다. 이를 위해 독립성 검정을 실시하고 해당 검정의 p-value를 기술하시오.
# - 검정은 STEM 전공자를 대상으로 한다.
# - 검정은 충분히 발달된 도시(도시 개발 지수가 제 85 백분위수 초과)에 거주하는 사람을
# 대상으로 한다.
# - 이직 의사 여부(target)은 문자열로 변경 후 사용한다.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# =============================================================================

In [ ]:


# =============================================================================
# 3.(Dataset_13_train.csv를 활용하여) 인사팀에서는 어떤 직원이 이직 의사를 가지고 있을지
# 사전에 파악하고 1:1 면담 등 집중 케어를 하고자 한다. 이를 위해 의사결정 나무를
# 활용하여 모델을 생성하고 그 정확도를 확인하시오.
# - target을 종속변수로 하고 나머지 변수 중 String이 아닌 변수를 독립변수로 한다.
# - 학습은 전부 기본값으로 실시한다.
# - 평가는 "Dataset_13_test.csv" 데이터로 실시한다.
# - 정확도는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
#
# =============================================================================

# (참고)
# from sklearn.tree import DecisionTreeClassifier
# random_state = 123

In [ ]:

# =============================================================================
# =============================================================================
# # 문제 14 유형(DataSet_14.csv 이용)
#
# 구분자 : comma(“,”), 2000 Rows, 9 Columns, UTF-8 인코딩
#
# 온라인 교육업체 싱글캠퍼스에서 런칭한 교육 플랫폼을 보다
# 체계적으로 운영하기 위해 2014년부터 2016년 동안 개설된 강좌
# 2000개를 대상으로 강좌 실적 및 고객의 서비스 분석을 실시하려고
# 한다. 관련 데이터는 다음과 같다.
#
# 컬 럼 / 정 의 / Type
# id / 강좌 일련번호 / Double
# published / 강과 개설일 / String
# subject / 강좌 대주제 / String
# level / 난이도 / String
# price / 가격(만원) / Double
# subscribers / 구독자 수(결제 인원) / Double
# reviews / 리뷰 개수 / Double
# lectures / 강좌 영상 수 / Double
# duration / 강좌 총 길이(시간) / Double
# =============================================================================
# =============================================================================

In [ ]:

# =============================================================================
# 1.결제 금액이 1억 이상이면서 구독자의 리뷰 작성 비율이 10% 이상인 교육의 수는?
# - 결제 금액은 강좌 가격에 구독자 수를 곱한 값이다.
# - 리뷰 작성 비율은 리뷰 개수에 구독자 수를 나눈 값이다. (답안 예시) 1
# =============================================================================

In [ ]:

# =============================================================================
# 2.강좌 가격이 비쌀수록 구독자 숫자는 줄어든다는 가설을 확인하기 위해 상관분석을
# 실시하고자 한다. 2016년 개설된 Web Development 강좌를 대상으로 강좌 가격과
# 구독자 수의 피어슨 상관관계를 기술하시오.
# - 상관계수는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# =============================================================================

In [ ]:

# =============================================================================
# 3.유저가 서비스 사용에 익숙해지고 컨텐츠의 좋은 내용을 서로 공유하려는 경향이
# 전반적으로 증가하는 추세라고 한다. 이를 위해 먼저 강좌 개설 년도별 구독자의 리뷰
# 작성 비율의 평균이 강좌 개설 년도별로 차이가 있는지 일원 분산 분석을 통해서
# 알아보고자 한다. 이 때 검정통계량을 기술하시오.
# - 검정통계량은 반올림하여 소수점 첫째 자리까지 기술하시오. (답안 예시) 0.1
#
# (참고)
# from statsmodels.formula.api import ols
# from statsmodels.stats.anova import anova_lm
# =============================================================================

In [75]:


# =============================================================================
# =============================================================================
# # 문제 05 유형(Dataset_05_Mart_POS.csv /  이용)
#
# =============================================================================
# Dataset_05_Mart_POS.csv
# 구분자 : comma(“,”), 20488 Rows, 3 Columns, UTF-8 인코딩
# =============================================================================
#
# 원룸촌에 위치한 A마트는 데이터 분석을 통해 보다 체계적인 재고관리와
# 운영을 하고자 한다. 이를 위해 다음의 두 데이터 세트를 준비하였다.
#
# 컬 럼 / 정 의 / Type
# Member_number / 고객 고유 번호 / Double
# Date / 구매일 / String
# itemDescription / 상품명 / String

# =============================================================================
# Dataset_05_item_list.csv
# 구분자 : comma(“,”), 167 Rows, 4 Columns, UTF-8 인코
# =============================================================================
#
# 컬 럼 / 정 의 / Type
# prod_id / 상품 고유 번호 / Double
# prod_nm / 상품명 / String
# alcohol / 주류 상품 여부(1 : 주류) / Integer
# frozen / 냉동 상품 여부(1 : 냉동) / Integer
# =============================================================================
# =============================================================================

In [76]:
import pandas as pd
import numpy as np

pos = pd.read_csv('Dataset/Dataset_05_Mart_POS.csv')
list1 = pd.read_csv('Dataset/Dataset_05_item_list.csv')

In [77]:
pos.head()

   Member_number        Date itemDescription
0           1220  2015-01-01     canned beer
1           1220  2015-01-01       margarine
2           1220  2015-01-01       chocolate
3           1235  2015-01-01         sausage
4           1235  2015-01-01         sausage

In [78]:
list1.head()

   prod_id           prod_nm  alcohol  frozen
0        1    tropical fruit        0       0
1        2        whole milk        0       0
2        3         pip fruit        0       0
3        4  other vegetables        0       0
4        5        rolls/buns        0       0

In [79]:
pos.isnull().sum()

Member_number      0
Date               0
itemDescription    0
dtype: int64

In [81]:
list1.isnull().sum()

prod_id    0
prod_nm    0
alcohol    0
frozen     0
dtype: int64

In [82]:

# =============================================================================
# 1.(Dataset_05_Mart_POS.csv를 활용하여) 가장 많은 제품이 팔린 날짜에 가장 많이 팔린
# 제품의 판매 개수는? (답안 예시) 1
# =============================================================================

In [83]:
pos.columns

Index(['Member_number', 'Date', 'itemDescription'], dtype='object')

In [84]:
list1.columns

Index(['prod_id', 'prod_nm', 'alcohol', 'frozen'], dtype='object')

In [85]:
pos['Date'].value_counts()

2015-01-21    96
2015-07-21    93
2015-11-29    92
2015-08-08    92
2015-04-30    91
              ..
2015-12-21    29
2015-11-05    29
2015-03-16    23
2015-03-17    23
2015-09-01    22
Name: Date, Length: 364, dtype: int64

In [86]:
pos['Date'].value_counts().idxmax()

'2015-01-21'

In [87]:
q1 = pos['Date'].value_counts().idxmax()

In [90]:
pos[pos.Date == q1]['itemDescription'].value_counts().max()

7

In [91]:
# 답 : 7

In [92]:

# =============================================================================
# 2. (Dataset_05_Mart_POS.csv, Dataset_05_item_list.csv를 활용하여) 고객이 주류 제품을
# 구매하는 요일이 다른 요일에 비해 금요일과 토요일이 많을 것이라는 가설을 세웠다.
# 이를 확인하기 위해 금요일과 토요일의 일별 주류제품 구매 제품 수 평균과 다른
# 요일의 일별 주류제품 구매 제품 수 평균이 서로 다른지 비교하기 위해 독립 2표본
# t검정을 실시하시오.
# 해당 검정의 p-value를 기술하시오.
# - 1분기(1월 ~ 3월) 데이터만 사용하여 분석을 실시하시오.
# - 등분산 가정을 만족하지 않는다는 조건 하에 분석을 실시하시오.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# =============================================================================

In [93]:
type(pos.Date)

pandas.core.series.Series

In [95]:
pos.Date.dtype

dtype('O')

In [102]:
pos.itemDescription.str.slice(0,2)

0        ca
1        ma
2        ch
3        sa
4        sa
         ..
20483    cr
20484    ca
20485    ca
20486    de
20487    cu
Name: itemDescription, Length: 20488, dtype: object

In [103]:
pd.to_datetime(pos.Date)

0       2015-01-01
1       2015-01-01
2       2015-01-01
3       2015-01-01
4       2015-01-01
           ...
20483   2015-12-30
20484   2015-12-30
20485   2015-12-30
20486   2015-12-30
20487   2015-12-30
Name: Date, Length: 20488, dtype: datetime64[ns]

In [122]:
pd.to_datetime(pos.Date).dt.day_name(locale='ko')

0        목요일
1        목요일
2        목요일
3        목요일
4        목요일
        ...
20483    수요일
20484    수요일
20485    수요일
20486    수요일
20487    수요일
Name: Date, Length: 20488, dtype: object

In [123]:
pos1 = pos.copy()

In [125]:
pos1

       Member_number        Date itemDescription
0               1220  2015-01-01     canned beer
1               1220  2015-01-01       margarine
2               1220  2015-01-01       chocolate
3               1235  2015-01-01         sausage
4               1235  2015-01-01         sausage
...              ...         ...             ...
20483           4058  2015-12-30    cream cheese
20484           4565  2015-12-30     canned beer
20485           4565  2015-12-30     canned beer
20486           4863  2015-12-30         dessert
20487           4863  2015-12-30            curd

[20488 rows x 3 columns]

In [126]:
pos1['month'] = pd.to_datetime(pos1.Date).dt.month
pos1

       Member_number        Date itemDescription  month
0               1220  2015-01-01     canned beer      1
1               1220  2015-01-01       margarine      1
2               1220  2015-01-01       chocolate      1
3               1235  2015-01-01         sausage      1
4               1235  2015-01-01         sausage      1
...              ...         ...             ...    ...
20483           4058  2015-12-30    cream cheese     12
20484           4565  2015-12-30     canned beer     12
20485           4565  2015-12-30     canned beer     12
20486           4863  2015-12-30         dessert     12
20487           4863  2015-12-30            curd     12

[20488 rows x 4 columns]

In [132]:
pos1['day'] = pd.to_datetime(pos1.Date).dt.day_name(locale='ko')
pos1

       Member_number        Date itemDescription  month  day
0               1220  2015-01-01     canned beer      1  목요일
1               1220  2015-01-01       margarine      1  목요일
2               1220  2015-01-01       chocolate      1  목요일
3               1235  2015-01-01         sausage      1  목요일
4               1235  2015-01-01         sausage      1  목요일
...              ...         ...             ...    ...  ...
20483           4058  2015-12-30    cream cheese     12  수요일
20484           4565  2015-12-30     canned beer     12  수요일
20485           4565  2015-12-30     canned beer     12  수요일
20486           4863  2015-12-30         dessert     12  수요일
20487           4863  2015-12-30            curd     12  수요일

[20488 rows x 5 columns]

In [133]:
pos1['week'] = np.where(pos1['day'].isin(['금요일', '토요일']), 1, 0)
pos1

       Member_number        Date itemDescription  month  day  week
0               1220  2015-01-01     canned beer      1  목요일     0
1               1220  2015-01-01       margarine      1  목요일     0
2               1220  2015-01-01       chocolate      1  목요일     0
3               1235  2015-01-01         sausage      1  목요일     0
4               1235  2015-01-01         sausage      1  목요일     0
...              ...         ...             ...    ...  ...   ...
20483           4058  2015-12-30    cream cheese     12  수요일     0
20484           4565  2015-12-30     canned beer     12  수요일     0
20485           4565  2015-12-30     canned beer     12  수요일     0
20486           4863  2015-12-30         dessert     12  수요일     0
20487           4863  2015-12-30            curd     12  수요일     0

[20488 rows x 6 columns]

In [134]:
list1

     prod_id                prod_nm  alcohol  frozen
0          1         tropical fruit        0       0
1          2             whole milk        0       0
2          3              pip fruit        0       0
3          4       other vegetables        0       0
4          5             rolls/buns        0       0
..       ...                    ...      ...     ...
162      163         pudding powder        0       0
163      164            ready soups        0       0
164      165        make up remover        0       0
165      166         toilet cleaner        0       0
166      167  preservation products        0       0

[167 rows x 4 columns]

In [137]:
merge1 = pd.merge(pos1, list1, left_on='itemDescription', right_on='prod_nm', how='left')
merge1

,Member_number,Date,itemDescription,month,day,week,prod_id,prod_nm,alcohol,frozen
0,1220,2015-01-01,canned beer,1,목요일,0,25,canned beer,1,0
1,1220,2015-01-01,margarine,1,목요일,0,70,margarine,0,0
2,1220,2015-01-01,chocolate,1,목요일,0,14,chocolate,0,0
3,1235,2015-01-01,sausage,1,목요일,0,19,sausage,0,0
4,1235,2015-01-01,sausage,1,목요일,0,19,sausage,0,0
...,...,...,...,...,...,...,...,...,...,...
20483,4058,2015-12-30,cream cheese,12,수요일,0,60,cream cheese,0,0
20484,4565,2015-12-30,canned beer,12,수요일,0,25,canned beer,1,0
20485,4565,2015-12-30,canned beer,12,수요일,0,25,canned beer,1,0
20486,4863,2015-12-30,dessert,12,수요일,0,51,dessert,0,0
20487,4863,2015-12-30,curd,12,수요일,0,45,curd,0,0

In [138]:
merge2 = merge1[merge1.month.isin([1, 2, 3])]
merge2

,Member_number,Date,itemDescription,month,day,week,prod_id,prod_nm,alcohol,frozen
0,1220,2015-01-01,canned beer,1,목요일,0,25,canned beer,1,0
1,1220,2015-01-01,margarine,1,목요일,0,70,margarine,0,0
2,1220,2015-01-01,chocolate,1,목요일,0,14,chocolate,0,0
3,1235,2015-01-01,sausage,1,목요일,0,19,sausage,0,0
4,1235,2015-01-01,sausage,1,목요일,0,19,sausage,0,0
...,...,...,...,...,...,...,...,...,...,...
5074,4678,2015-03-31,condensed milk,3,화요일,0,54,condensed milk,0,0
5075,4678,2015-03-31,pot plants,3,화요일,0,6,pot plants,0,0
5076,4678,2015-03-31,cling film/bags,3,화요일,0,85,cling film/bags,0,0
5077,4678,2015-03-31,soda,3,화요일,0,38,soda,0,0
5078,4678,2015-03-31,shopping bags,3,화요일,0,71,shopping bags,0,0

In [141]:
q2_tab = pd.pivot_table(merge2, index='Date', columns='week', values='alcohol', aggfunc='sum')
q2_tab

week          0    1
Date
2015-01-01  4.0  NaN
2015-01-02  NaN  3.0
2015-01-03  NaN  2.0
2015-01-04  4.0  NaN
2015-01-05  5.0  NaN
...         ...  ...
2015-03-27  NaN  5.0
2015-03-28  NaN  2.0
2015-03-29  5.0  NaN
2015-03-30  3.0  NaN
2015-03-31  4.0  NaN

[90 rows x 2 columns]

In [142]:
from scipy.stats import ttest_ind

In [143]:
q2_out = ttest_ind(q2_tab[0].dropna(), q2_tab[1].dropna(), equal_var=False)
q2_out

Ttest_indResult(statistic=2.335264239960428, pvalue=0.023062611047582393)

In [144]:
q2_out.pvalue

0.023062611047582393

In [145]:
round(q2_out.pvalue, 2)

0.02

In [146]:
# 답 : 0.02

In [147]:

# =============================================================================
# 3.(Dataset_05_Mart_POS.csv를 활용하여) 1년 동안 가장 많이 판매된 10개 상품을 주력
# 상품으로 설정하고 특정 요일에 프로모션을 진행할지 말지 결정하고자 한다. 먼저
# 요일을 선정하기 전에 일원 분산 분석을 통하여 요일별 주력 상품의 판매 개수의
# 평균이 유의미하게 차이가 나는지 알아보고자 한다. 이와 관련하여 일원 분산 분석을
# 실시하고 p-value를 기술하시오.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
#
# (참고)
# from statsmodels.formula.api import ols
# from statsmodels.stats.anova import anova_lm
# =============================================================================

In [148]:
pos1

       Member_number        Date itemDescription  month  day  week
0               1220  2015-01-01     canned beer      1  목요일     0
1               1220  2015-01-01       margarine      1  목요일     0
2               1220  2015-01-01       chocolate      1  목요일     0
3               1235  2015-01-01         sausage      1  목요일     0
4               1235  2015-01-01         sausage      1  목요일     0
...              ...         ...             ...    ...  ...   ...
20483           4058  2015-12-30    cream cheese     12  수요일     0
20484           4565  2015-12-30     canned beer     12  수요일     0
20485           4565  2015-12-30     canned beer     12  수요일     0
20486           4863  2015-12-30         dessert     12  수요일     0
20487           4863  2015-12-30            curd     12  수요일     0

[20488 rows x 6 columns]

In [149]:
q3 = pos1.copy()

In [151]:
top10 = pos1.itemDescription.value_counts().nlargest(10)
top10

whole milk          1464
other vegetables    1039
rolls/buns           879
sausage              744
soda                 737
yogurt               694
tropical fruit       668
root vegetables      592
citrus fruit         544
frankfurter          505
Name: itemDescription, dtype: int64

In [153]:
top10_list = top10.index
top10_list

Index(['whole milk', 'other vegetables', 'rolls/buns', 'sausage', 'soda',
       'yogurt', 'tropical fruit', 'root vegetables', 'citrus fruit',
       'frankfurter'],
      dtype='object')

In [154]:
q3 = pos1[pos1.itemDescription.isin(top10_list)]
q3

       Member_number        Date   itemDescription  month  day  week
3               1235  2015-01-01           sausage      1  목요일     0
4               1235  2015-01-01           sausage      1  목요일     0
7               1422  2015-01-01    tropical fruit      1  목요일     0
18              2641  2015-01-01  other vegetables      1  목요일     0
19              2768  2015-01-01    tropical fruit      1  목요일     0
...              ...         ...               ...    ...  ...   ...
20461           2997  2015-12-30    tropical fruit     12  수요일     0
20462           2997  2015-12-30       frankfurter     12  수요일     0
20466           2997  2015-12-30        whole milk     12  수요일     0
20473           3562  2015-12-30        rolls/buns     12  수요일     0
20474           3579  2015-12-30  other vegetables     12  수요일     0

[7866 rows x 6 columns]

In [161]:
q3_agg = q3.groupby(['Date', 'day'])['itemDescription'].apply(len).reset_index()
q3_agg

           Date  day  itemDescription
0    2015-01-01  목요일               16
1    2015-01-02  금요일               13
2    2015-01-03  토요일               28
3    2015-01-04  일요일               21
4    2015-01-05  월요일               30
..          ...  ...              ...
359  2015-12-26  토요일               11
360  2015-12-27  일요일               31
361  2015-12-28  월요일               21
362  2015-12-29  화요일               27
363  2015-12-30  수요일               18

[364 rows x 3 columns]

In [162]:
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [163]:
anova = ols('itemDescription~day', data=q3_agg).fit()

In [164]:
print(anova_lm(anova))

             df        sum_sq    mean_sq        F    PR(>F)
day         6.0    219.527473  36.587912  0.86853  0.518128
Residual  357.0  15039.076923  42.126266      NaN       NaN

In [170]:
anova.f_pvalue

0.5181278037418174

In [171]:
q3_out = anova_lm(anova)

In [172]:
q3_out['PR(>F)'][0]

0.5181278037418069

In [174]:
round(q3_out['PR(>F)'][0], 2)

0.52

In [ ]:
# 답 : 0.52